app/forms/user_purchase.rb

  def save
    purchase = Purchase.create(item_id: item_id, user_id: user_id)
    Place.create(prefecture_id: prefecture_id, postal_code: postal_code, city: city, address: address, building: building, phone_number: phone_number, purchase_id: purchase.id)
---
INSERT INTO `purchases` (`created_at`, `updated_at`, `user_id`, `item_id`) VALUES ('2020-09-08 02:58:56.975593', '2020-09-08 02:58:56.975593', 5, 5)
INSERT INTO `places` (`prefecture_id`, `postal_code`, `city`, `address`, `phone_number`, `created_at`, `updated_at`, `purchase_id`) VALUES (2, '123-4567', '横浜市緑区', '青山1-1-1', '08011111111', '2020-09-08 03:32:34.689928', '2020-09-08 03:32:34.689928', 3)
INSERT INTO `purchases` (`created_at`, `updated_at`, `user_id`, `item_id`) VALUES ('2020-09-07 23:37:26.714461', '2020-09-07 23:37:26.714461', 4, 3)