app/views/items/index.html.erb


        <% if item.purchase.present? %>
---
SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` = 3 LIMIT 1