app/views/items/show.html.erb

SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` = 1 LIMIT 1
---
      <%# 商品が売れている場合は、sold outの表示をしましょう。 %>
      <% if @item.purchase.present? %>