app/controllers/items_controller.rb

  def update
    if @item.update(items_params)
---
UPDATE `items` SET `items`.`updated_at` = '2020-09-07 09:51:30.294579' WHERE `items`.`id` = 2

  def purchase
    if @item.purchase.present?
---
SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` = 15 LIMIT 1

  def set_params
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 15 LIMIT 1