app/controllers/items_controller.rb

SELECT `items`.* FROM `items` ORDER BY created_at DESC
---
  def index
    @items = Item.all.order('created_at DESC')

INSERT INTO `items` (`category_id`, `status_id`, `postage_id`, `area_id`, `shipping_id`, `created_at`, `updated_at`, `title`, `introduction`, `price`, `user_id`) VALUES (6, 2, 2, 4, 2, '2020-09-07 09:51:30.283034', '2020-09-07 09:51:30.283034', 'テスト', 'テスト', 400000, 3)
---
  def create
    @item = Item.new(items_params)
    if @item.save

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
---
  def show
    @item = Item.find(params[:id])
    @messages = @item.messages.includes(:user)

SELECT `purchases`.* FROM `purchases` WHERE `purchases`.`item_id` = 15 LIMIT 1
---
  def purchase
    if @item.purchase.present?

INSERT INTO `places` (`prefecture_id`, `postal_code`, `city`, `address`, `phone_number`, `created_at`, `updated_at`, `purchase_id`) VALUES (5, '123-4567', '横浜市緑区', '青山1-1-1', '08011111111', '2020-09-07 23:37:26.734786', '2020-09-07 23:37:26.734786', 1)
INSERT INTO `purchases` (`created_at`, `updated_at`, `user_id`, `item_id`) VALUES ('2020-09-07 23:37:26.714461', '2020-09-07 23:37:26.714461', 4, 3)
---
  def buy
    @place = UserPurchase.new(card_params)
    if @place.valid?
      pay_item
      @place.save

SELECT `items`.* FROM `items` WHERE `items`.`id` IN (4, NULL)
---
  def set_params
    @item = Item.find(params[:id])